// Задача 6: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.

// 	456 -> 6
// 	782 -> 2
// 	918 -> 8

int N=918;
int num= N%10;
Console.WriteLine(num);